package com.test.java;

public class Ex10_Error {

	public static void main(String[] args) {
		
		/*
		 
		 에러, Error
		 - 오류, 버그(Bug), 예외(Exception) 등..
		 - 에러/오류 > 수정/고친다.
		 - 버그 > 디버그
		 - 예외 > 예외처리
		 
		 1. 컴파일 에러
		 	- 컴파일 작업 중에 발생하는 에러
		 	- 컴파일 > 소스 번역 > 잘못된 문법 > 발견 > 중지
		 	- 반드시 해결(100%)
		 	- 난이도 가장 낮음 > 컴파일러가 알려줌 + 에러 메시지
		 	- 오타내면 발생 > 빨간 밑줄
		 
		 2. 런타임 에러
		 	- 런타임(Runtime) > 프로그램이 실행 중
		 	- 컴파일 작업 중에 에러가 없었는데 > 실행 중에 발생하는 에러
		 	- 예외(Exception)
		 	- 난이도 중간 > 발견을 할 수도, 못 할 수도 있음
		 
		 3. 논리 에러
		 	- 컴파일 성공 + 실행 성공 > 결과가 이상;;
		 	- 난이도 최상 > 본인이 짜고도 본인이 모름
		 
		 */
		
		// 키보드 숫자 입력
		//int a = 10;
		
		// 나누기: 피제수/제수(정수 간의 나누기에는 제수가 0이 될 수 없음)
		//System.out.println(100 / a);
		

		
	}
	
}
